In [12]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [13]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [14]:
df.Age = df.Age.fillna(df.Age.mean())

In [15]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

**Changing the nominal columns to dummies**

In [16]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [17]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [18]:
#drping male column bc of dummy trap
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [19]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [21]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [22]:
#normal distribution so used Gaussian
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [23]:
model.fit(X_train,y_train)

GaussianNB()

In [24]:
model.score(X_test,y_test)

0.7821229050279329

In [25]:
X_test[0:10]

     Pclass        Age      Fare  female
292       2  36.000000   12.8750       0
174       1  56.000000   30.6958       0
393       1  23.000000  113.2750       1
436       3  21.000000   34.3750       1
389       2  17.000000   12.0000       1
163       3  17.000000    8.6625       0
678       3  43.000000   46.9000       1
451       3  29.699118   19.9667       0
502       3  29.699118    7.6292       1
728       2  25.000000   26.0000       0

In [26]:
y_test[0:10]

292    0
174    0
393    1
436    0
389    1
163    0
678    0
451    0
502    0
728    0
Name: Survived, dtype: int64

In [27]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 1, 0, 1, 0, 1, 0], dtype=int64)

In [28]:
model.predict_proba(X_test[:10])

array([[0.93152553, 0.06847447],
       [0.71232474, 0.28767526],
       [0.00138026, 0.99861974],
       [0.38455985, 0.61544015],
       [0.21190444, 0.78809556],
       [0.9588627 , 0.0411373 ],
       [0.38142974, 0.61857026],
       [0.96845959, 0.03154041],
       [0.45611884, 0.54388116],
       [0.91839268, 0.08160732]])

In [29]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.74825175, 0.81118881, 0.71126761, 0.79577465, 0.8028169 ])